app/views/sessions/open.html.erb

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."user_id" = $1  [["user_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <li class="dropdown">
  				<a data-toggle="dropdown" class="dropdown-toggle" href="#">Logout   <%= User.find(session[:user_id]).username%> <b class="caret"></b></a>

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        </tr><br>
		<% User.find(session[:user_id]).accounts.each do |account| %>

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <div class = "transactionTable">
    <%User.find(session[:user_id]).accounts.each do |account| %>

SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 ORDER BY "transactions"."balance" DESC  [["account_id", 1]]
---

           <%account.transactions.order(balance: :desc).each do |transaction| %>

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	   <script>
       <% User.find(session[:user_id]).accounts.each do |account| %>

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."user_id" = $1  [["user_id", 3]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      function showData(x){
        <% User.find(session[:user_id]).accounts.each do |account| %>