app/views/sessions/showtransaction.html.erb

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <li class="dropdown">
  				<a data-toggle="dropdown" class="dropdown-toggle" href="#">Logout   <%= User.find(session[:user_id]).username%> <b class="caret"></b></a>