app/views/admin/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
        <li class="dropdown">
  				<a data-toggle="dropdown" class="dropdown-toggle" href="#">Logout   <%= User.find(session[:user_id]).username%> <b class="caret"></b></a>