app/views/admin/show.html.erb

        <li class="dropdown">
  				<a data-toggle="dropdown" class="dropdown-toggle" href="#">Logout   <%= User.find(session[:user_id]).username%> <b class="caret"></b></a>
---
SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


	  <% @user.accounts.each do |account| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]