app/controllers/accounts_controller.rb

  def create
    @user = User.find(params[:user_id])
    @account = @user.accounts.create(account_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "accounts" ("name", "email", "password", "balance", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"