app/controllers/admin_controller.rb

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])