app/controllers/sessions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def showtransaction
    @transaction = Transaction.find(params[:format])
    @account = Account.find(@transaction.account_id)
    @user = User.find(@account.user_id)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test0"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(username: params[:session][:username].downcase)