app/controllers/transactions_controller.rb

  def create
    @account = Account.find(params[:account_id])
    @transaction = @account.transactions.new(transaction_params)
    @account.balance = @transaction.amount+@account.balance

    @account.save
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "transactions" SET "date" = $1, "balance" = $2, "updated_at" = $3 WHERE "transactions"."id" = $4  [["date", "2020-12-20"], ["balance", 700.0], ["updated_at", "2020-12-20 16:51:12.090793"], ["id", 126]]
INSERT INTO "transactions" ("sender", "payee", "description", "amount", "account_id", "created_at", "updated_at", "currency") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 700.0], ["updated_at", "2020-12-20 16:51:12.081890"], ["id", 4]]