app/views/accounts/show.html.erb

	</tr>
	<% @account.transactions.order(balance: :desc).each do |transaction| %>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 ORDER BY "transactions"."balance" DESC  [["account_id", 3]]

  <%= link_to 'Edit', edit_account_path(@account) %> |
  <%= link_to 'Back', admin_path(User.find(@account.user_id)) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]